# แบบฝึกหัด 2

---

จากข้อมูล titanic.csv ให้ทำการวิเคราะห์ข้อมูลเบื้องต้นเกี่ยวกับคอลัมน์ cabin  
โดยแผนภาพด้านล่างนี้เป็นตำแหน่งของ cabin ตามตัวอักษรตัวแรกของรหัส cabin ที่บันทึกในชุดข้อมูล

![titanic-cabin](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Olympic_%26_Titanic_cutaway_diagram.png/800px-Olympic_%26_Titanic_cutaway_diagram.png)

ให้นิสิตสร้างคอลัมน์เพิ่ม โดยคอลัมน์ที่เพิ่มมานี้ จะเก็บข้อมูลของตัวอักษรตัวแรกที่ปรากฏในคอลัมน์ Cabin เช่น  
- หากในคอลัมน์ Cabin เป็นค่า "C123" ในคอลัมน์ที่สร้างจะบันทึก "C"  
- หากในคอลัมน์ Cabin เป็นค่า "C23 C25 C27" ในคอลัมน์ที่สร้างจะบันทึก "C"
- หากในคอลัมน์ Cabin เป็นค่า "B58 B60 C2" ในคอลัมน์ที่สร้างจะบันทึก "B"
- หากในคอลัมน์ Cabin เป็นค่า "F2" ในคอลัมน์ที่สร้างจะบันทึก "F"
- หากในคอลัมน์ Cabin เป็นค่า NaN ในคอลัมน์ที่สร้างจะบันทึก NaN

จากนั้นให้นิสิตเขียนโค้ดเพื่อตอบคำถามในแต่ละข้อ

In [1]:
import numpy as np
import pandas as pd

In [2]:
# from google.colab import drive
# drive.mount('/content/drive')

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/ThammakornS/ProgStat/main/dataset/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

นิสิตแสดงวิธีสร้างคอลัมน์

In [4]:
df['CabinLetter'] = df.Cabin.str.get(0) #df['Cabin'].str.get(0)
df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,CabinLetter
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,NaN
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,E
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,NaN
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,NaN
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,NaN
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,G
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,C
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,NaN
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,NaN
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,NaN
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,NaN
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,NaN
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,NaN
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,NaN
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,NaN

In [5]:
#หรือ

# not pd.isnull(s) คือการตรวจสอบว่า s ไม่ใช่ค่าว่าง (NaN)
# else np.nan for s in df.Cabin คือถ้า s เป็นค่าว่าง จะใส่ค่า NaN ลงไปแทน
df['CabinLetter'] = [s[0] if not pd.isnull(s) else np.nan for s in df.Cabin]
df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,CabinLetter
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,NaN
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,E
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,NaN
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,NaN
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,NaN
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S,G
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,C
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S,NaN
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,NaN
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S,NaN
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,NaN
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q,NaN
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S,NaN
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S,NaN
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,NaN

1. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารกี่คน และมีจำนวน NaN เท่าไหร่

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
 12  CabinLetter  204 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

In [7]:
#your code
# df['CabinLetter'].value_counts(dropna=False)
# dropna=False เพื่อให้แสดงจำนวนของค่า NaN ด้วย
df.CabinLetter.value_counts(dropna=False)

CabinLetter
NaN    687
C       59
B       47
D       33
E       32
A       15
F       13
G        4
T        1
Name: count, dtype: int64

In [8]:
pd.crosstab(df.CabinLetter, df.Pclass, margins=False)

Pclass        1  2  3
CabinLetter
A            15  0  0
B            47  0  0
C            59  0  0
D            29  4  0
E            25  4  3
F             0  8  5
G             0  0  4
T             1  0  0

2. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารที่รอดและเสียชีวิตอย่างละเท่าไหร่ cabin ใดมีจำนวนผู้เสียชีวิตมากที่สุด

In [9]:
#your code
letterCabin_survive = pd.crosstab(df.CabinLetter, df.Survived, margins=False)
# sort_values by=0 คือการเรียงลำดับโดยใช้คอลัมน์ที่มีชื่อว่า 0 (ซึ่งเป็นคอลัมน์ของผู้ที่ไม่รอดชีวิต)
# by=0 คือเสียชีวิต, ascending=False คือการเรียงลำดับจากมากไปน้อย
letterCabin_survive.sort_values(by=0, ascending=False)
# letterCabin_survive

Survived      0   1
CabinLetter
C            24  35
B            12  35
A             8   7
D             8  25
E             8  24
F             5   8
G             2   2
T             1   0

In [10]:
letterCabin_survive[0]

CabinLetter
A     8
B    12
C    24
D     8
E     8
F     5
G     2
T     1
Name: 0, dtype: int64

In [11]:
letterCabin_survive

Survived      0   1
CabinLetter
A             8   7
B            12  35
C            24  35
D             8  25
E             8  24
F             5   8
G             2   2
T             1   0

In [12]:
letterCabin_survive[0].idxmax()

'C'

In [13]:
# สำหรับการเข้าถึงดัชนี (index) ของแถวที่มีค่าสูงสุด
letterCabin_survive.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'T'], dtype='object', name='CabinLetter')

In [14]:
# สำหรรับการเข้าถึงดัชนี (index) ของแถวที่มีค่าสูงสุด โดยใช้ np.argmax คืนค่าเป็นตำแหน่งดัชนี
np.argmax(letterCabin_survive[0])

np.int64(2)

In [15]:
letterCabin_survive.index[np.argmax(letterCabin_survive[0])]

'C'

In [16]:
# สำหรับการเข้าถึงดัชนี (index) ของแถวที่มีค่าสูงสุด
letterCabin_survive.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'T'], dtype='object', name='CabinLetter')

In [17]:
np.argmax(letterCabin_survive[0])

np.int64(2)

In [18]:
# df.assign

3. cabin ใดมีค่า สัดส่วน จำนวนผู้รอดชีวิตหารด้วยจำนวนผู้เสียชีวิต สูงสุด

In [19]:
#your code
letterCabin_survive['surv/die'] = letterCabin_survive[1]/letterCabin_survive[0]
letterCabin_survive.sort_values(by='surv/die', ascending=False)

Survived      0   1  surv/die
CabinLetter
D             8  25  3.125000
E             8  24  3.000000
B            12  35  2.916667
F             5   8  1.600000
C            24  35  1.458333
G             2   2  1.000000
A             8   7  0.875000
T             1   0  0.000000

In [20]:
letterCabin_survive['surv/die'].idxmax()

'D'

In [21]:
letterCabin_survive['surv/die'].idxmin()

'T'

4. cabin ใดมีค่าเฉลี่ยราคาตั๋ว (Fare) สูงสุด

In [22]:
#your code
fare_avg = df.filter(['Fare','CabinLetter']).\
    groupby(['CabinLetter']).\
    mean().\
    sort_values(by='Fare', ascending=False)
fare_avg

                   Fare
CabinLetter
B            113.505764
C            100.151341
D             57.244576
E             46.026694
A             39.623887
T             35.500000
F             18.696792
G             13.581250

5. จงแสดงค่าเฉลี่ยราคาตั๋ว (Fare) ของผู้รอดชีวิต และผู้เสียชีวิต ในแต่ละ cabin หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า

In [23]:
df.filter(['Survived','Fare','CabinLetter']).\
    groupby(['CabinLetter', 'Survived']).\
        mean()

                            Fare
CabinLetter Survived
A           0          35.496350
            1          44.341071
B           0          57.137500
            1         132.832026
C           0          99.972396
            1         100.274046
D           0          53.770825
            1          58.356176
E           0          43.715625
            1          46.797050
F           0          11.340000
            1          23.294787
G           0          10.462500
            1          16.700000
T           0          35.500000

In [24]:
#your code
# filter ใช้เลือกคอลัมน์ที่ต้องการ
# groupby ใช้จัดกลุ่มข้อมูลตามคอลัมน์ที่ระบุ
# mean ใช้คำนวณค่าเฉลี่ยของแต่ละกลุ่ม
df.filter(['Survived','Fare','CabinLetter']).\
    groupby(['CabinLetter', 'Survived']).\
        mean().\
            unstack(level='Survived') # unstack ใช้เปลี่ยนรูปแบบของ DataFrame โดยย้ายระดับของดัชนี (index level) ไปเป็นคอลัมน์ (columns)

                  Fare
Survived             0           1
CabinLetter
A            35.496350   44.341071
B            57.137500  132.832026
C            99.972396  100.274046
D            53.770825   58.356176
E            43.715625   46.797050
F            11.340000   23.294787
G            10.462500   16.700000
T            35.500000         NaN

In [27]:
pd.crosstab(
    index=df['CabinLetter'],
    columns=df['Survived'],
    values=df['Fare'],      # ระบุคอลัมน์ที่จะเอามาคำนวณ (เหมือนตอน filter เอา Fare มา)
    aggfunc='mean'          # ระบุว่าให้คำนวณค่าเฉลี่ย (เหมือน .mean())
)

Survived             0           1
CabinLetter
A            35.496350   44.341071
B            57.137500  132.832026
C            99.972396  100.274046
D            53.770825   58.356176
E            43.715625   46.797050
F            11.340000   23.294787
G            10.462500   16.700000
T            35.500000         NaN

ค่าเฉลี่ยราคาตั๋วผู้รอดสูงกว่าผู้เสียชีวิต (แต่ยังไม่สามารถสรุปได้ว่ามีนัยสำคัญหรือไม่)

6. ในแต่ละ cabin มีจำนวนผู้โดยสารแยกตาม Pclass อย่างละกี่คน

In [25]:
#your code
pd.crosstab(df.CabinLetter, df.Pclass)

Pclass        1  2  3
CabinLetter
A            15  0  0
B            47  0  0
C            59  0  0
D            29  4  0
E            25  4  3
F             0  8  5
G             0  0  4
T             1  0  0